---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ElementFailures
source: html/661d5e4f-37ce-093b-ac29-acd4be6e68fa.htm
---
# BuiltInFailures.ElementFailures Properties

Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.